In [1]:
import pandas as pd

In [20]:
My_1st_Series = pd.Series([5,8,9],index=list('abc'))
My_1st_Series

a    5
b    8
c    9
dtype: int64

In [14]:
My_1st_Series.index([list'abc'])
My_1st_Series

SyntaxError: invalid syntax (<ipython-input-14-889de99d1f94>, line 1)

In [35]:
Info_Ciudades = pd.DataFrame({'Province': ('Madrid','Valencia','Sevilla','Barcelona','Málaga'),
                             'Population': (3000000,15000000,1200000,1800000,1350000),
                             'Year': ['1600','1650','1350','1400','1500']},
                              index=('City_1','City_2','City_3','City_4','City_5'))
Info_Ciudades

         Province  Population  Year
City_1     Madrid     3000000  1600
City_2   Valencia    15000000  1650
City_3    Sevilla     1200000  1350
City_4  Barcelona     1800000  1400
City_5     Málaga     1350000  1500

In [53]:
Info_Ciudades = pd.DataFrame({'City': ('Madrid','Valencia','Sevilla','Barcelona','Málaga'),
                             'Population': (3000000,15000000,1200000,1800000,1350000),
                             'Year': ['1600','1650','1350','1400','1500']},
                              index = [f'City_{n+1}' for n in range(len('City')+1)]
                            )

Info_Ciudades

             City  Population  Year
City_1     Madrid     3000000  1600
City_2   Valencia    15000000  1650
City_3    Sevilla     1200000  1350
City_4  Barcelona     1800000  1400
City_5     Málaga     1350000  1500

In [55]:
Info_Ciudades.apply(lambda col: col.max() + col.min())

City          ValenciaBarcelona
Population             16200000
Year                   16501350
dtype: object

In [56]:
Info_Ciudades.apply(lambda col: col.max() + col.min()).iloc[0]

'ValenciaBarcelona'

In [63]:
Info_Ciudades.sort_values(by = 'Population', ascending = False)

             City  Population  Year
City_2   Valencia    15000000  1650
City_1     Madrid     3000000  1600
City_4  Barcelona     1800000  1400
City_5     Málaga     1350000  1500
City_3    Sevilla     1200000  1350

In [73]:
Info_Ciudades = Info_Ciudades.rename_axis('Nome Coluna', axis=1)
Info_Ciudades = Info_Ciudades.rename_axis('Nome linha', axis=0)
Info_Ciudades

Nome Coluna       City  Population  Year
Nome linha
City_1          Madrid     3000000  1600
City_2        Valencia    15000000  1650
City_3         Sevilla     1200000  1350
City_4       Barcelona     1800000  1400
City_5          Málaga     1350000  1500

In [74]:
Info_Ciudades['Country']='Spain'
Info_Ciudades

Nome Coluna       City  Population  Year Country
Nome linha
City_1          Madrid     3000000  1600   Spain
City_2        Valencia    15000000  1650   Spain
City_3         Sevilla     1200000  1350   Spain
City_4       Barcelona     1800000  1400   Spain
City_5          Málaga     1350000  1500   Spain

In [76]:
Info_Ciudades['Population']

Nome linha
City_1     3000000
City_2    15000000
City_3     1200000
City_4     1800000
City_5     1350000
Name: Population, dtype: int64

In [83]:
Info_Ciudades['Population']['City_2']=1500000

<ipython-input-83-4993fdc4fd7b>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  Info_Ciudades['Population']['City_2']=1500000

In [84]:
Info_Ciudades

Nome Coluna       City  Population  Year Country
Nome linha
City_1          Madrid     3000000  1600   Spain
City_2        Valencia     1500000  1650   Spain
City_3         Sevilla     1200000  1350   Spain
City_4       Barcelona     1800000  1400   Spain
City_5          Málaga     1350000  1500   Spain

In [86]:
Info_Ciudades.columns

Index(['City', 'Population', 'Year', 'Country'], dtype='object', name='Nome Coluna')

In [92]:
df1 = pd.DataFrame({
    'data1':[0,1,1,2],
    'key':['b','b','b','a']
})

df1

   data1 key
0      0   b
1      1   b
2      1   b
3      2   a

In [94]:
df1.drop_duplicates('key')

   data1 key
0      0   b
3      2   a

In [99]:
Info_Ciudades.loc['Population']

KeyError: 'Population'

In [100]:
Info_Ciudades

Nome Coluna       City  Population  Year Country
Nome linha
City_1          Madrid     3000000  1600   Spain
City_2        Valencia     1500000  1650   Spain
City_3         Sevilla     1200000  1350   Spain
City_4       Barcelona     1800000  1400   Spain
City_5          Málaga     1350000  1500   Spain

In [105]:
Info_Ciudades.loc[[False,False,False,False,True]]

Nome Coluna    City  Population  Year Country
Nome linha
City_5       Málaga     1350000  1500   Spain

In [121]:
Info_Ciudades.loc[['City_3','City_4']]

Nome Coluna       City  Population  Year Country
Nome linha
City_3         Sevilla     1200000  1350   Spain
City_4       Barcelona     1800000  1400   Spain